In [139]:
%matplotlib inline
import numpy as np
import numpy.ma as ma
import pandas as pd
from pandas import DataFrame, Series
import matplotlib.pyplot as plt
import seaborn as sns
import timeit
import line_profiler

import datetime

from io import StringIO
from pandas.api.types import CategoricalDtype

import pandas._testing as tm

## returns df from string data
def gdf(data):
    return pd.read_csv(StringIO(data))

In [551]:
d="""datetime,A
2012-08-14 07:00,1
2012-08-14 07:30,300
2012-08-14 08:15,3
2013-08-14 16:00,600
2013-08-14 16:15,700"""
df1=gdf(d)
df1

           datetime    A
0  2012-08-14 07:00    1
1  2012-08-14 07:30  300
2  2012-08-14 08:15    3
3  2013-08-14 16:00  600
4  2013-08-14 16:15  700

In [552]:
d="""datetime,B
2012-08-14 07:00,100
2012-08-14 07:15,200
2012-08-14 07:30,300
2013-09-24 15:45, 50
2013-09-24 16:00, 60
2013-09-24 16:15, 70"""
df2=gdf(d)
df2

           datetime    B
0  2012-08-14 07:00  100
1  2012-08-14 07:15  200
2  2012-08-14 07:30  300
3  2013-09-24 15:45   50
4  2013-09-24 16:00   60
5  2013-09-24 16:15   70

In [553]:
df1.merge(df2, left_on=['datetime', 'A'], right_on=['datetime', 'B'],
         how='inner')

           datetime    A    B
0  2012-08-14 07:30  300  300

In [2]:
df = pd.DataFrame({
    'Date':[16234.0, 16003.]
})
#epoch = pd.to_datetime(0, unit='s').to_julian_date()
#pd.to_datetime(epoch - df.Date, unit='D')
pd.to_datetime('2016.01.03').to_julian_date()

pd.to_datetime(df.Date, format='%y%j')

0   2016-08-21
1   2016-01-03
Name: Date, dtype: datetime64[ns]

In [5]:
d = """col1,col2,col4
A,2,[2-3-4]
B,3,[2-6]
A,3,[2-3-4]
C,2,[2-3-4]
D,2,[2-3-4]"""
df=gdf(d)
df

  col1  col2     col4
0    A     2  [2-3-4]
1    B     3    [2-6]
2    A     3  [2-3-4]
3    C     2  [2-3-4]
4    D     2  [2-3-4]

In [6]:
df['col4'] = df.col4.astype(str).str.replace('-',',')
df['col2'] = df.col2.astype(str)
df= df[df.apply(lambda x: x.col2 in x.col4, axis=1)]
df

  col1 col2     col4
0    A    2  [2,3,4]
2    A    3  [2,3,4]
3    C    2  [2,3,4]
4    D    2  [2,3,4]

In [7]:
d="""Id,Valore
ID554,53.0
ID554,43.0
ID522,42.0
ID522,32.0
ID566,26.0"""
df=gdf(d)
df

      Id  Valore
0  ID554    53.0
1  ID554    43.0
2  ID522    42.0
3  ID522    32.0
4  ID566    26.0

In [21]:
df1=pd.DataFrame(
    np.random.randn(10),
    columns=['a'],
    index=pd.date_range('2020.01.01', periods=10)
)
df2=pd.DataFrame(
    np.random.randn(10),
    columns=['a'],
    index=pd.date_range('2020.01.04', periods=10)
)
df1.loc[['2020.01.01', '2020.01.04']]

                   a
2020-01-01  0.026687
2020-01-04  0.018886

In [69]:
d="""c1,c2
-,75.0%
-5.5%,65.8%
-,6.9%"""
df=gdf(d)
df

      c1     c2
0      -  75.0%
1  -5.5%  65.8%
2      -   6.9%

In [71]:
df.replace(['%', '-','%'],['', 0.0, ''])
df.replace({'\%':'', '-$':0.0}, regex=True)
# Thanks to tdy
df.replace({'\%':'', r'^\s*-\s*$':0}, regex=True)
#df.replace()

     c1    c2
0     0  75.0
1  -5.5  65.8
2     0   6.9

In [44]:
d="""A
-0.5
-0.43
1
3.2
-0.97
6.3"""
df=gdf(d)
df

      A
0 -0.50
1 -0.43
2  1.00
3  3.20
4 -0.97
5  6.30

In [54]:
(df['A']>0)

0    False
1    False
2     True
3     True
4    False
5     True
Name: A, dtype: bool

In [52]:
df.A.mask(df.A<0,0)

0    0.0
1    0.0
2    1.0
3    3.2
4    0.0
5    6.3
Name: A, dtype: float64

In [62]:
df = pd.DataFrame({'a':[1,2,3,4,5,6,7,100,9],
                   'b':[1,2,3,4,5,6,7,8,9]})
df.rolling(3).corr()
df.corr(method='kendall')

          a         b
a  1.000000  0.944444
b  0.944444  1.000000

In [65]:
df['a'].rolling(3).corr(df.b)

0         NaN
1         NaN
2    1.000000
3    1.000000
4    1.000000
5    1.000000
6    1.000000
7    0.870619
8    0.018823
dtype: float64

In [106]:
datas = [['A', 51, 'id1', '2020-05-27 05:50:43.346'], ['A', 51, 'id2',
'2020-05-27 05:51:08.347'], ['B', 45, 'id3', '2020-05-24 17:23:55.142'],['B', 45, 'id4', '2020-05-24 17:23:30.141'], ['C', 34,
'id5', '2020-05-23 17:31:10.341']]

df = pd.DataFrame(datas, columns = ['col1', 'col2', 'cold_id',
'dates'])
df

  col1  col2 cold_id                    dates
0    A    51     id1  2020-05-27 05:50:43.346
1    A    51     id2  2020-05-27 05:51:08.347
2    B    45     id3  2020-05-24 17:23:55.142
3    B    45     id4  2020-05-24 17:23:30.141
4    C    34     id5  2020-05-23 17:31:10.341

In [75]:
datas = [['A', 51, 'id1 id2', 'date_1'], ['B', 45, 'id3 id4',
'date_2'], ['C', 34, 'id5', 'date_3']]

dfo = pd.DataFrame(datas, columns = ['col1', 'col2', 'col_id',
'dates'])
dfo

  col1  col2   col_id   dates
0    A    51  id1 id2  date_1
1    B    45  id3 id4  date_2
2    C    34      id5  date_3

In [107]:
df['dates'] = pd.to_datetime(df.dates)
#df = df.set_index('dates')
df

  col1  col2 cold_id                   dates
0    A    51     id1 2020-05-27 05:50:43.346
1    A    51     id2 2020-05-27 05:51:08.347
2    B    45     id3 2020-05-24 17:23:55.142
3    B    45     id4 2020-05-24 17:23:30.141
4    C    34     id5 2020-05-23 17:31:10.341

In [114]:
#df.groupby([df['dates'].dt.date]).agg(','.join)
df['dates'] = pd.to_datetime(df.dates)
df.groupby([pd.Grouper(key='dates', freq='2 min'), 
            'col1', 'col2']).agg(','.join).reset_index().sort_values('col1').reset_index(drop=True)

                dates col1  col2  cold_id
0 2020-05-27 05:50:00    A    51  id1,id2
1 2020-05-24 17:22:00    B    45  id3,id4
2 2020-05-23 17:30:00    C    34      id5

In [135]:
d = """Borough,Neighborhood,Latitude,Longitude
River North,Auraria,39.7506,-105.0075
Capitol Hill,Cherry Creek,39.7195,-104.9481
Capitol Hill,Congress Park,39.7329,-104.9494
Lakeside,West Highland,39.7647,-105.0407
Lakeside,Sloan Lake,39.7486,-105.0473"""
df = gdf(d)

df

        Borough   Neighborhood  Latitude  Longitude
0   River North        Auraria   39.7506  -105.0075
1  Capitol Hill   Cherry Creek   39.7195  -104.9481
2  Capitol Hill  Congress Park   39.7329  -104.9494
3      Lakeside  West Highland   39.7647  -105.0407
4      Lakeside     Sloan Lake   39.7486  -105.0473

In [120]:
for i in df.Neighborhood.unique():
    exec(f"{i.replace(' ','_')} = df[df['Neighborhood'] == i]")

In [122]:
Auraria

       Borough Neighborhood  Latitude  Longitude
0  River North      Auraria   39.7506  -105.0075

In [123]:
Cherry_Creek

        Borough  Neighborhood  Latitude  Longitude
1  Capitol Hill  Cherry Creek   39.7195  -104.9481

In [138]:
dfs = {}

for df_name, df_val in df.groupby("Neighborhood"):
    df_name = df_name.replace(' ', '_')
    dfs[df_name] = df_val

for k, v in dfs.items():
    print("Name:", k)
    print("-" * 80)
    print(v)

dfs

Name: Auraria
--------------------------------------------------------------------------------
       Borough Neighborhood  Latitude  Longitude
0  River North      Auraria   39.7506  -105.0075
Name: Cherry_Creek
--------------------------------------------------------------------------------
        Borough  Neighborhood  Latitude  Longitude
1  Capitol Hill  Cherry Creek   39.7195  -104.9481
Name: Congress_Park
--------------------------------------------------------------------------------
        Borough   Neighborhood  Latitude  Longitude
2  Capitol Hill  Congress Park   39.7329  -104.9494
Name: Sloan_Lake
--------------------------------------------------------------------------------
    Borough Neighborhood  Latitude  Longitude
4  Lakeside   Sloan Lake   39.7486  -105.0473
Name: West_Highland
--------------------------------------------------------------------------------
    Borough   Neighborhood  Latitude  Longitude
3  Lakeside  West Highland   39.7647  -105.0407

{'Auraria':        Borough Neighborhood  Latitude  Longitude
 0  River North      Auraria   39.7506  -105.0075,
 'Cherry_Creek':         Borough  Neighborhood  Latitude  Longitude
 1  Capitol Hill  Cherry Creek   39.7195  -104.9481,
 'Congress_Park':         Borough   Neighborhood  Latitude  Longitude
 2  Capitol Hill  Congress Park   39.7329  -104.9494,
 'Sloan_Lake':     Borough Neighborhood  Latitude  Longitude
 4  Lakeside   Sloan Lake   39.7486  -105.0473,
 'West_Highland':     Borough   Neighborhood  Latitude  Longitude
 3  Lakeside  West Highland   39.7647  -105.0407}

In [125]:
Auraria

       Borough Neighborhood  Latitude  Longitude
0  River North      Auraria   39.7506  -105.0075

In [141]:
d="""startIP,endIP,countryISO
16777216,16777471,US
16777472,16778239,CN
16778240,16779263,AU"""
df1=gdf(d)
df1

    startIP     endIP countryISO
0  16777216  16777471         US
1  16777472  16778239         CN
2  16778240  16779263         AU

In [142]:
d="""sourceIP, eventTime, integerIP
114.119.157.43,01/Mar/2021,1920441643
193.205.128.7,01/Mar/2021,3251470343
193.205.128.7,01/Mar/2021,3251470343
193.205.128.7,01/Mar/2021,3251470343"""
df2=gdf(d)
df2

         sourceIP    eventTime   integerIP
0  114.119.157.43  01/Mar/2021  1920441643
1   193.205.128.7  01/Mar/2021  3251470343
2   193.205.128.7  01/Mar/2021  3251470343
3   193.205.128.7  01/Mar/2021  3251470343

      startIP       endIP countryISO        sourceIP    eventTime   integerIP
0  16777216.0  16777471.0         US  114.119.157.43  01/Mar/2021  1920441643
1  16777472.0  16778239.0         CN   193.205.128.7  01/Mar/2021  3251470343
2  16778240.0  16779263.0         AU   193.205.128.7  01/Mar/2021  3251470343
3         NaN         NaN        NaN   193.205.128.7  01/Mar/2021  3251470343

In [185]:
d="""movieId,title,genres
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy
6,Dummy 3 Title (1995),Comedy"""
df=gdf(d)
df

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Dummy 3 Title (1995),Comedy

In [188]:
df.title.str.extract(r"\((\d+)\)")

      0
0  1995
1  1995
2  1995
3  1995
4  1995
5  1995

In [216]:
d="""date,time,value
NaN,1103,5  
NaN,0010,10
NaN,0100,6
NaN,0201,8
NaN,0015,7
12.03.2020,0400,4
NaN,0500,6
NaN,0800,3
NaN,1000,4
NaN,1140,5
12.03.2020,1200,2
NaN,0030,1
NaN,0112,0"""
df=pd.read_csv(StringIO(d), dtype='str')
df.head(8)

         date  time value
0         NaN  1103   5
1         NaN  0010    10
2         NaN  0100     6
3         NaN  0201     8
4         NaN  0015     7
5  12.03.2020  0400     4
6         NaN  0500     6
7         NaN  0800     3

In [222]:
df['date']=pd.to_datetime(df.date, format='%d.%m.%Y')
df['newtime']=pd.to_datetime(df.time, format="%H%M")

In [232]:
#pd.to_timedelta(df.newtime.dt.time)
np.where(df.date.ne(pd.nat))

         date  time value             newtime
0         NaT  1103   5   1900-01-01 11:03:00
1         NaT  0010    10 1900-01-01 00:10:00
2         NaT  0100     6 1900-01-01 01:00:00
3         NaT  0201     8 1900-01-01 02:01:00
4         NaT  0015     7 1900-01-01 00:15:00
5  2020-03-12  0400     4 1900-01-01 04:00:00
6         NaT  0500     6 1900-01-01 05:00:00
7         NaT  0800     3 1900-01-01 08:00:00
8         NaT  1000     4 1900-01-01 10:00:00
9         NaT  1140     5 1900-01-01 11:40:00
10 2020-03-12  1200     2 1900-01-01 12:00:00
11        NaT  0030     1 1900-01-01 00:30:00
12        NaT  0112     0 1900-01-01 01:12:00

AttributeError: 'Timestamp' object has no attribute 'dt'